Revit 2024 API
CanExecuteEventArgs.IsChecked Property
The value that indicates whether the UI associated with the Command associated with this event is in a checked state.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public bool IsChecked { get; set; }
Visual Basic
Public Property IsChecked As Boolean
	Get
	Set
Visual C++
public:
property bool IsChecked {
	bool get ();
	void set (bool value);
}
See Also
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace